Revit 2025 API
LoadType Enumeration
 This enum declares types of Loads.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LoadType
Public Enumeration LoadType
public enum class LoadType
type LoadType
Members
Member name | Value | Description
Point | 0 |  Point Load
Line | 1 |  Line Load
Area | 2 |  Area Load
See Also
Reference
Autodesk.Revit.DB.Structure Namespace